/*
SQLyog 企业版 - MySQL GUI v8.14 
MySQL - 5.6.21-log : Database - day14
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`day14` /*!40100 DEFAULT CHARACTER SET gbk */;

USE `day14`;

/*Table structure for table `codes` */

DROP TABLE IF EXISTS `codes`;

CREATE TABLE `codes` (
  `id` int(255) NOT NULL AUTO_INCREMENT,
  `username` varchar(255) NOT NULL,
  `code` int(255) DEFAULT NULL,
  PRIMARY KEY (`username`),
  UNIQUE KEY `id` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=10 DEFAULT CHARSET=gbk;

/*Data for the table `codes` */

insert  into `codes`(`id`,`username`,`code`) values (7,'13751333',667282),(6,'13751338740',234132),(8,'15818401990',864432),(9,'15818436150',985730);

/*Table structure for table `family` */

DROP TABLE IF EXISTS `family`;

CREATE TABLE `family` (
  `id` int(100) NOT NULL AUTO_INCREMENT,
  `username` varchar(100) NOT NULL DEFAULT '',
  `nick` varchar(100) DEFAULT NULL,
  `email` varchar(100) DEFAULT NULL,
  `birthday` varchar(100) DEFAULT NULL,
  `gender` varchar(100) DEFAULT NULL,
  `high` varchar(100) DEFAULT NULL,
  `weight` varchar(100) DEFAULT NULL,
  `familygroup` varchar(100) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `FK_family` (`username`),
  CONSTRAINT `FK_family` FOREIGN KEY (`username`) REFERENCES `user` (`username`)
) ENGINE=InnoDB AUTO_INCREMENT=31 DEFAULT CHARSET=gbk CHECKSUM=1 DELAY_KEY_WRITE=1 ROW_FORMAT=DYNAMIC;

/*Data for the table `family` */

insert  into `family`(`id`,`username`,`nick`,`email`,`birthday`,`gender`,`high`,`weight`,`familygroup`) values (1,'13751338740','小冠',NULL,'1993年2月1日','1993年2月1日','100cm','58kg','是'),(5,'13751338740','小激动',NULL,'女','女','null','null','否'),(17,'13751338740','爱',NULL,'1970年1月1日','1978年2月1日','170cm','60kg','否'),(29,'13751338740','亲友',NULL,'1970年1月1日','男','170cm','60kg','否'),(30,'13751338740','小',NULL,'1970年1月1日','男','170cm','60kg','否');

/*Table structure for table `result` */

DROP TABLE IF EXISTS `result`;

CREATE TABLE `result` (
  `id` int(255) NOT NULL AUTO_INCREMENT,
  `username` varchar(255) NOT NULL DEFAULT '',
  `nick` varchar(100) DEFAULT NULL,
  `time` varchar(255) DEFAULT NULL,
  `rate_grade` varchar(100) DEFAULT NULL,
  `symptoms_rhythm` varchar(100) DEFAULT NULL,
  `rate_average` varchar(100) DEFAULT NULL,
  `rate_min` varchar(100) DEFAULT NULL,
  `rate_max` varchar(100) DEFAULT NULL,
  `rhythm_heart` varchar(100) DEFAULT NULL,
  `sinus_arrest` varchar(100) DEFAULT NULL,
  `cardia_heart` varchar(100) DEFAULT NULL,
  `heart_beat_number` varchar(100) DEFAULT NULL,
  `psvc_number` varchar(100) DEFAULT NULL,
  `pvc_number` varchar(100) DEFAULT NULL,
  `QRS` varchar(100) DEFAULT NULL,
  `RR` varchar(100) DEFAULT NULL,
  `QT` varchar(100) DEFAULT NULL,
  `PR` varchar(100) DEFAULT NULL,
  `QTC` varchar(100) DEFAULT NULL,
  `symptoms_heart` varchar(100) DEFAULT NULL,
  `symptoms_heart_left` varchar(100) DEFAULT NULL,
  `symptoms_heart_right` varchar(100) DEFAULT NULL,
  `symptoms_heart_two` varchar(100) DEFAULT NULL,
  `report` varchar(400) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `FK_result` (`username`),
  CONSTRAINT `FK_result` FOREIGN KEY (`username`) REFERENCES `user` (`username`)
) ENGINE=InnoDB AUTO_INCREMENT=134 DEFAULT CHARSET=gbk;

/*Data for the table `result` */

insert  into `result`(`id`,`username`,`nick`,`time`,`rate_grade`,`symptoms_rhythm`,`rate_average`,`rate_min`,`rate_max`,`rhythm_heart`,`sinus_arrest`,`cardia_heart`,`heart_beat_number`,`psvc_number`,`pvc_number`,`QRS`,`RR`,`QT`,`PR`,`QTC`,`symptoms_heart`,`symptoms_heart_left`,`symptoms_heart_right`,`symptoms_heart_two`,`report`) values (1,'user','ddd','2015年03月11日   16:12:37','83','室性期前收缩','83次/分','60','138','稍微不齐','否','正常','24','0','1','0.0ms','722.2222ms','0.0ms','0.0ms','0.0ms','无症状','无症状','无症状','无症状',NULL),(2,'user','ddd','2015年03月11日   20:03:50','82','室性期前收缩','82次/分','58','138','稍微不齐','否','正常','43','0','3','0.0ms','725.0ms','0.0ms','0.0ms','0.0ms','无症状','无症状','无症状','无症状',NULL),(70,'13751338740','小激动','2015年04月17日   15:18:52','51','室上性期前收缩室性期前收缩','51次/分','25','155','稍微不齐','否','正常','26','3','4','0.0ms','1175.0ms','0.0ms','0.0ms','0.0ms','两房负荷增重','较轻','严重','较轻',NULL),(71,'13751338740','小激动','2015年04月17日   15:20:02','60','健康','60次/分','58','62','整齐','否','正常','23','0','0','0.0ms','994.44446ms','0.0ms','0.0ms','0.0ms','无症状','较轻','无症状','无症状',NULL),(72,'13751338740','小激动','2015年04月17日   15:22:05','91','室性期前收缩','91次/分','47','167','稍微不齐','否','正常','62','0','1','0.0ms','652.7778ms','0.0ms','0.0ms','0.0ms','无症状','较轻','无症状','无症状',NULL),(73,'13751338740','小冠','2015年04月17日   15:26:42','58','健康','58次/分','51','65','整齐','否','正常','17','0','0','0.0ms','1027.7778ms','0.0ms','0.0ms','0.0ms','无症状','无症状','无症状','无症状',NULL),(75,'13751338740','小冠','2015年04月21日   22:03:58','52','健康','52次/分','48','117','整齐','否','正常','4','2','0','0.0ms','1138.8888ms','0.0ms','0.0ms','0.0ms','无症状','无症状','无症状','无症状',NULL),(76,'13751338740','小激动','2015年04月24日   15:07:11','85','健康','85次/分','78','91','整齐','否','正常','44','0','0','0.0ms','702.77783ms','0.0ms','0.0ms','0.0ms','无症状','较轻','','无症状',NULL),(77,'13751338740','小冠','2015年04月24日   21:41:37','70','健康','70次/分','66','74','整齐','否','正常','31','0','0','0.0ms','852.7778ms','0.0ms','0.0ms','0.0ms','无症状','严重','无症状','无症状',NULL),(78,'13751338740','小激动','2015年04月29日   23:21:31','63','健康','63次/分','56','71','整齐','否','正常','18','0','0','0.0ms','950.0ms','0.0ms','0.0ms','0.0ms','无症状','无症状','','无症状',NULL),(79,'15818401990','亲友','2015年05月04日   23:04:45','41','健康','41次/分','11','110','整齐','是','正常','12','0','0','0.0ms','1441.6667ms','0.0ms','0.0ms','0.0ms','两房负荷增重','较轻','严重','较轻',NULL),(80,'15818436150','小冠','2015年05月05日   21:21:01','46','健康','46次/分','26','53','整齐','否','正常','10','0','0','0.0ms','1294.4445ms','0.0ms','0.0ms','0.0ms','无症状','无症状','较轻','无症状',NULL),(81,'13751338740','小冠','2015年05月05日   22:29:23','85','健康','85次/分','78','91','整齐','否','正常','44','0','0','0.0ms','702.77783ms','0.0ms','0.0ms','0.0ms','无症状','较轻','','无症状',NULL),(82,'13751338740','小激动','2015年05月13日   21:58:19','60','健康','60次/分','56','68','整齐','否','正常','13','0','0','0.0ms','986.1111ms','0.0ms','0.0ms','0.0ms','无症状','无症状','严重','无症状',NULL),(83,'13751338740','小激动','2015年05月13日   22:02:01','72','健康','72次/分','70','74','整齐','否','正常','11','0','0','0.0ms','827.77783ms','0.0ms','0.0ms','0.0ms','无症状','较轻','较轻','无症状',NULL),(87,'13751338740','小激动','2015年05月13日   22:11:30','86','健康','86次/分','82','90','整齐','否','正常','13','0','0','0.0ms','694.4444ms','0.0ms','0.0ms','0.0ms','无症状','严重','无症状','无症状',NULL),(88,'13751338740','小激动','2015年05月13日   22:17:00','20','健康','20次/分','110','110','整齐','否','心动过缓','3','0','0','0.0ms','2880.5557ms','0.0ms','0.0ms','0.0ms','两房负荷增重','较轻','较轻','较轻',NULL),(90,'13751338740','小激动','2015年05月13日   22:21:25','83','健康','83次/分','78','86','整齐','否','正常','12','0','0','0.0ms','719.44446ms','0.0ms','0.0ms','0.0ms','无症状','无症状','无症状','无症状',NULL),(91,'13751338740','小激动','2015年05月13日   22:26:00','62','','62次/分','53','78','稍微不齐','否','正常','9','0','0','0.0ms','952.77783ms','0.0ms','0.0ms','0.0ms','无症状','无症状','较轻','无症状',NULL),(93,'13751338740','小激动','2015年05月14日   12:40:57','59','室性期前收缩','59次/分','28','143','稍微不齐','否','正常','9','0','1','0.0ms','1002.77783ms','0.0ms','0.0ms','0.0ms','无症状','较轻','较轻','无症状',NULL),(94,'13751338740','小激动','2015年05月14日   12:51:39','65','室性期前收缩','65次/分','43','113','不整齐','否','正常','34','0','6','0.0ms','919.44446ms','0.0ms','0.0ms','0.0ms','无症状','无症状','','无症状',NULL),(95,'13751338740','小冠','2015年05月18日   12:37:51','72','健康','72次/分','70','74','整齐','否','正常','11','0','0','0.0ms','827.77783ms','0.0ms','0.0ms','0.0ms','无症状','较轻','较轻','无症状',NULL),(96,'13751338740','小冠','2015年05月18日   12:38:08','48','健康','48次/分','25','117','整齐','否','正常','7','3','0','0.0ms','1250.0ms','0.0ms','0.0ms','0.0ms','无症状','无症状','较轻','无症状',NULL),(97,'13751338740','小冠','2015年05月18日   19:29:21','85','健康','85次/分','78','91','整齐','否','正常','57','0','0','0.0ms','700.0ms','0.0ms','0.0ms','0.0ms','无症状','较轻','','无症状',NULL),(98,'13751338740','小冠','2015年05月18日   19:38:19','75','健康','75次/分','69','502','整齐','否','正常','23','0','0','0.0ms','791.6667ms','0.0ms','0.0ms','0.0ms','无症状','非常严重','较轻','无症状',NULL),(99,'13751338740','小冠','2015年05月18日   19:39:50','58','健康','58次/分','51','65','整齐','否','正常','9','0','0','0.0ms','1019.44446ms','0.0ms','0.0ms','0.0ms','无症状','无症状','无症状','无症状',NULL),(100,'13751338740','小冠','2015年05月28日   15:16:57','79','健康','79次','77','81','整齐','否','正常','23','0','0','0.0ms','752.7778ms','0.0ms','0.0ms','0.0ms','无症状','较轻','无症状','无症状',NULL),(101,'13751338740','小冠','2015年05月29日   20:21:53','80','健康','80次','77','81','整齐','否','正常','17','0','0','0.0ms','750.0ms','0.0ms','0.0ms','0.0ms','无症状','无症状','无症状','无症状',NULL),(102,'13751338740','小冠','2015年05月29日   22:46:27','85','健康','85次','80','90','整齐','否','正常','77','0','0','0.0ms','700.0ms','0.0ms','0.0ms','0.0ms','无症状','非常严重','无症状','无症状',NULL),(103,'13751338740','小冠','2015年05月29日   23:02:31','83','健康','83次','78','87','整齐','否','正常','24','0','0','0.0ms','716.6666ms','0.0ms','0.0ms','0.0ms','无症状','较轻','较轻','无症状',NULL),(104,'13751338740','爱','2015年06月01日   09:52:21','75','健康','75次','69','502','整齐','否','正常','28','0','0','0.0ms','794.44446ms','0.0ms','0.0ms','0.0ms','无症状','非常严重','较轻','无症状',NULL),(105,'13751338740','小冠','2015年06月04日   17:26:52','79','健康','79次','76','81','整齐','否','正常','29','0','0','0.0ms','755.55554ms','0.0ms','0.0ms','0.0ms','无症状','较轻','较轻','无症状',NULL),(106,'13751338740','小冠','2015年06月04日   17:30:07','43','健康','43次','24','53','整齐','否','正常','19','0','0','0.0ms','1394.4445ms','0.0ms','0.0ms','0.0ms','两房负荷增重','较轻','较轻','较轻',NULL),(107,'13751338740','小冠','2015年06月04日   17:30:39','65','室性期前收缩','65次','43','113','不整齐','否','正常','24','0','3','0.0ms','916.6667ms','0.0ms','0.0ms','0.0ms','无症状','无症状','','无症状',NULL),(108,'13751338740','小冠','2015年06月04日   17:32:01','41','健康','41次','24','53','整齐','否','正常','15','0','0','0.0ms','1438.8889ms','0.0ms','0.0ms','0.0ms','两房负荷增重','较轻','较轻','较轻',NULL),(109,'13751338740','小冠','2015年06月04日   17:32:49','65','室性期前收缩','65次','43','113','不整齐','否','正常','24','0','3','0.0ms','916.6667ms','0.0ms','0.0ms','0.0ms','无症状','无症状','','无症状',NULL),(110,'13751338740','小冠','2015年06月04日   18:01:18','86','健康','86次','82','90','整齐','否','正常','33','0','0','0.0ms','694.4444ms','0.0ms','0.0ms','0.0ms','无症状','非常严重','无症状','无症状',NULL),(111,'13751338740','小冠','2015年06月04日   18:01:56','79','健康','79次','76','81','整齐','否','正常','29','0','0','0.0ms','755.55554ms','0.0ms','0.0ms','0.0ms','无症状','较轻','较轻','无症状',NULL),(112,'13751338740','小冠','2015年06月04日   23:17:25','53','','53次','53','76','稍微不齐','否','正常','11','0','0','0.0ms','1119.4445ms','0.0ms','0.0ms','0.0ms','无症状','无症状','较轻','无症状',NULL),(113,'13751338740','小冠','2015年06月04日   23:17:35','50','室上性期前收缩室性期前收缩','50次','18','100','稍微不齐','是','正常','21','1','1','0.0ms','1200.0ms','0.0ms','0.0ms','0.0ms','无症状','较轻','严重','无症状',NULL),(114,'13751338740','小冠','2015年06月04日   23:19:28','92','健康','92次','-14','66','整齐','是','正常','11','0','0','0.0ms','650.0ms','0.0ms','0.0ms','0.0ms','无症状','无症状','较轻','无症状',NULL),(115,'13751338740','小冠','2015年06月04日   23:19:39','50','室上性期前收缩室性期前收缩','50次','-14','100','稍微不齐','是','正常','21','1','1','0.0ms','1200.0ms','0.0ms','0.0ms','0.0ms','无症状','较轻','','无症状',NULL),(116,'13751338740','小冠','2015年06月04日   23:24:12','92','室性期前收缩','92次','47','167','稍微不齐','否','正常','35','0','1','0.0ms','647.2222ms','0.0ms','0.0ms','0.0ms','无症状','较轻','较轻','无症状',NULL),(117,'13751338740','小冠','2015年06月04日   23:27:40','66','室性期前收缩','66次','43','113','不整齐','否','正常','30','0','5','0.0ms','908.3334ms','0.0ms','0.0ms','0.0ms','无症状','无症状','严重','无症状',NULL),(118,'13751338740','小冠','2015年06月07日   23:33:04','75','健康','75次','69','502','整齐','否','正常','28','0','0','0.0ms','794.44446ms','0.0ms','0.0ms','0.0ms','无症状','非常严重','较轻','无症状',NULL),(119,'13751338740','小冠','2015年06月07日   23:33:10','75','健康','75次','69','553','整齐','否','正常','39','0','0','0.0ms','797.22217ms','0.0ms','0.0ms','0.0ms','无症状','非常严重','较轻','无症状',NULL),(120,'13751338740','爱','2015年06月11日   23:31:11','47','健康','47次','11','110','整齐','是','正常','17','0','0','0.0ms','1258.3334ms','0.0ms','0.0ms','0.0ms','两房负荷增重','较轻','严重','较轻',NULL),(121,'13751338740','小激动','2015年06月12日   00:06:10','60','健康','60次','58','62','整齐','否','正常','23','0','0','0.0ms','994.44446ms','0.0ms','0.0ms','0.0ms','无症状','较轻','无症状','无症状',NULL),(122,'13751338740','小冠','2015年06月12日   00:09:57','92','室性期前收缩','92次','47','167','稍微不齐','否','正常','35','0','1','0.0ms','647.2222ms','0.0ms','0.0ms','0.0ms','无症状','较轻','较轻','无症状',NULL),(123,'13751338740','小冠','2015年06月12日   00:15:46','86','健康','86次','82','90','整齐','否','正常','32','0','0','0.0ms','694.4444ms','0.0ms','0.0ms','0.0ms','无症状','非常严重','无症状','无症状',NULL),(124,'13751338740','小激动','2015年06月12日   00:37:57','129','健康','129次','102','211','整齐','否','心动过速','18','1','0','0.0ms','463.8889ms','0.0ms','0.0ms','0.0ms','无症状','无症状','','无症状',NULL),(125,'13751338740','小冠','2015年06月12日   16:20:25','120','健康','120次','118','120','整齐','否','正常','6','0','0','0.0ms','497.22223ms','0.0ms','0.0ms','0.0ms','无症状','无症状','严重','无症状',NULL),(126,'13751338740','小冠','2015年06月12日   16:32:05','132','健康','132次','124','143','整齐','否','心动过速','9','0','0','0.0ms','452.77777ms','0.0ms','0.0ms','0.0ms','无症状','无症状','严重','无症状',NULL),(127,'13751338740','小冠','2015年06月12日   18:18:47','132','健康','132次','171','174','整齐','否','心动过速','14','0','0','0.0ms','452.77777ms','0.0ms','0.0ms','0.0ms','无症状','无症状','较轻','无症状',NULL),(128,'13751338740','小冠','2015年06月12日   18:21:28','113','健康','113次','9','5400','整齐','是','正常','51','0','0','0.0ms','530.55554ms','0.0ms','0.0ms','0.0ms','无症状','无症状','较轻','无症状',NULL),(129,'13751338740','小冠','2015年06月12日   18:22:27','113','健康','113次','9','5400','整齐','是','正常','51','0','0','0.0ms','530.55554ms','0.0ms','0.0ms','0.0ms','无症状','无症状','较轻','无症状',NULL),(130,'13751338740','小冠','2015年06月12日   18:26:16','76','健康','76次','32','174','整齐','否','正常','15','0','0','0.0ms','788.88885ms','0.0ms','0.0ms','0.0ms','无症状','无症状','较轻','无症状',NULL),(131,'13751338740','小冠','2015年06月12日   18:28:09','136','健康','136次','130','143','整齐','否','心动过速','8','0','0','0.0ms','438.8889ms','0.0ms','0.0ms','0.0ms','无症状','无症状','较轻','无症状',NULL),(132,'13751338740','小冠','2015年06月13日   00:11:25','74','健康','74次','60','91','整齐','否','正常','13','1','0','0.0ms','802.7778ms','0.0ms','0.0ms','0.0ms','无症状','严重','无症状','无症状',NULL),(133,'13751338740','小冠','2015年07月18日   23:40:32','82','室性期前收缩','82次','58','138','稍微不齐','否','正常','37','0','3','0.0ms','725.0ms','0.0ms','0.0ms','0.0ms','无症状','无症状','无症状','无症状',NULL);

/*Table structure for table `user` */

DROP TABLE IF EXISTS `user`;

CREATE TABLE `user` (
  `id` int(255) NOT NULL AUTO_INCREMENT,
  `username` varchar(255) NOT NULL DEFAULT '',
  `password` varchar(255) DEFAULT NULL,
  `nick` varchar(255) DEFAULT NULL,
  `email` varchar(255) DEFAULT NULL,
  `birthday` varchar(255) DEFAULT NULL,
  `code` int(255) DEFAULT NULL,
  `gender` varchar(255) DEFAULT NULL,
  `high` varchar(255) DEFAULT NULL,
  `weight` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`username`),
  KEY `FK_user` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=10 DEFAULT CHARSET=gbk;

/*Data for the table `user` */

insert  into `user`(`id`,`username`,`password`,`nick`,`email`,`birthday`,`code`,`gender`,`high`,`weight`) values (5,'11','11','小冠',NULL,NULL,11,NULL,NULL,NULL),(6,'111','eee','哈',NULL,NULL,111,NULL,NULL,NULL),(7,'13751338740','13751338740','小冠',NULL,'1993年2月1日',477415,'1993年2月1日','100cm','58kg'),(8,'15818401990','wuliao123','无聊ing',NULL,NULL,864432,NULL,NULL,NULL),(9,'15818436150','123','曦魔天',NULL,NULL,985730,NULL,NULL,NULL),(1,'user','1111111',NULL,NULL,NULL,NULL,NULL,NULL,NULL),(2,'username','2222',NULL,NULL,NULL,NULL,NULL,NULL,NULL),(4,'小冠','11','11',NULL,NULL,11,NULL,NULL,NULL);

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
